{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "instrument_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "instrument_input"}, "inbound_nodes": []}, {"name": "instrument_embedding", "class_name": "Embedding", "config": {"name": "instrument_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 10, "output_dim": 2, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "maxval": null, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["instrument_input", 0, 0, {}]]]}, {"name": "salience_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 176], "dtype": "float32", "sparse": false, "name": "salience_input"}, "inbound_nodes": []}, {"name": "film1/gamma", "class_name": "Dense", "config": {"name": "film1/gamma", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instrument_embedding", 0, 0, {}]]]}, {"name": "input_conv", "class_name": "Conv1D", "config": {"name": "input_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["salience_input", 0, 0, {}]]]}, {"name": "multiply", "class_name": "Multiply", "config": {"name": "multiply", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["film1/gamma", 0, 0, {}], ["input_conv", 0, 0, {}]]]}, {"name": "film1/beta", "class_name": "Dense", "config": {"name": "film1/beta", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instrument_embedding", 0, 0, {}]]]}, {"name": "add", "class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["multiply", 0, 0, {}], ["film1/beta", 0, 0, {}]]]}, {"name": "film2/gamma", "class_name": "Dense", "config": {"name": "film2/gamma", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instrument_embedding", 0, 0, {}]]]}, {"name": "bidirectional", "class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["add", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["film2/gamma", 0, 0, {}], ["bidirectional", 0, 0, {}]]]}, {"name": "film2/beta", "class_name": "Dense", "config": {"name": "film2/beta", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instrument_embedding", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["multiply_1", 0, 0, {}], ["film2/beta", 0, 0, {}]]]}, {"name": "output_conv", "class_name": "Conv1D", "config": {"name": "output_conv", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}], "input_layers": [["salience_input", 0, 0], ["instrument_input", 0, 0]], "output_layers": [["output_conv", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "squashed_mse", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "bidirectional/forward_lstm/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/bias", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "film1/beta/kernel", "shape": [2, 256], "dtype": "float32"}, {"name": "film1/beta/bias", "shape": [256], "dtype": "float32"}, {"name": "film1/gamma/kernel", "shape": [2, 256], "dtype": "float32"}, {"name": "film1/gamma/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "film2/beta/kernel", "shape": [2, 512], "dtype": "float32"}, {"name": "film2/beta/bias", "shape": [512], "dtype": "float32"}, {"name": "film2/gamma/kernel", "shape": [2, 512], "dtype": "float32"}, {"name": "film2/gamma/bias", "shape": [512], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "input_conv/kernel", "shape": [1, 176, 256], "dtype": "float32"}, {"name": "input_conv/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "instrument_embedding/embeddings", "shape": [10, 2], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "output_conv/kernel", "shape": [1, 512, 80], "dtype": "float32"}, {"name": "output_conv/bias", "shape": [80], "dtype": "float32"}]}]}